##Q 1.  Create a table called employees with the following structure:
* emp_id (integer, should not be NULL and should be a primary key)
* emp_name (text, should not be NULL)
* age (integer, should have a check constraint to ensure the age is at least 18)
* email (text, should be unique for each employee)
* salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

**Ans** - SQL query to create the employees table with all the required constraints:

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY NOT NULL,
    emp_name TEXT NOT NULL,
    age INTEGER CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL DEFAULT 30000
);

**Explanation**
* emp_id is the primary key and cannot be NULL.
* emp_name cannot be NULL.
* age has a check constraint to ensure it is at least 18.
* email is unique for each employee.
* salary has a default value of 30,000.

##Q 2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide examples of common types of constraints.
**Ans** - **Purpose of Constraints in a Database**

Constraints are rules enforced on database columns to maintain data integrity and accuracy. They prevent invalid data from being entered into the database and ensure consistency across records.

**Constraints Maintain Data Integrity**

Constraints help maintain data integrity in the following ways:
1. Preventing Invalid Data Entry - Ensures only appropriate values are stored.
2. Enforcing Uniqueness - Prevents duplicate records where uniqueness is required.
3. Ensuring Relationships Between Tables - Helps maintain referential integrity.
4. Providing Default Values - Ensures fields have a meaningful default if no value is provided.
5. Restricting Actions - Limits what can be done to protect data from accidental changes or deletions.

**Common Types of Constraints with Examples**

**1. NOT NULL Constraint**

Ensures a column cannot store NULL values.
  * Example: Every employee must have a name.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT NOT NULL
);

**2. UNIQUE Constraint**

Ensures that all values in a column are unique across records.
* Example: No two employees can have the same email.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    email TEXT UNIQUE
);

**3. PRIMARY KEY Constraint**

A combination of NOT NULL and UNIQUE. Ensures each row is uniquely identifiable.
  * Example: emp_id should uniquely identify each employee.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY
);

**4. FOREIGN KEY Constraint**

Ensures relationships between tables and maintains referential integrity.
  * Example: department_id in employees must exist in departments table.

In [ ]:
CREATE TABLE departments (
    department_id INTEGER PRIMARY KEY,
    department_name TEXT NOT NULL
);

CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    department_id INTEGER,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

**5. CHECK Constraint**

Enforces a condition that values must meet.
  * Example: Employees must be at least 18 years old.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    age INTEGER CHECK (age >= 18)
);

**6. DEFAULT Constraint**
Assigns a default value if no value is provided.
  * Example: If no salary is provided, it defaults to 30,000.

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    salary DECIMAL DEFAULT 30000
);

**Conclusion**

Constraints ensure that only valid, consistent, and reliable data is stored in a database. By using them properly, you can avoid data corruption, duplicate records, and integrity issues in relational databases.

##Q 3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.
**Ans** -The NOT NULL constraint ensures that a column cannot contain NULL values. It is used when a column must always have valid data and should not be left empty.

**Reasons to Use NOT NULL:**
1. Ensures Required Data is Present - Prevents missing or incomplete records.
2. Maintains Data Integrity - Critical fields like employee names, emails, or order IDs should always have values.
3. Avoids Unexpected Errors - Prevents NULL-related issues in calculations and queries.
4. Improves Query Performance - Searching for NULL values can be inefficient in some cases.

* Example: Ensuring an Employee Name is Always Provided

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    emp_name TEXT NOT NULL
);

In this case, an employee record cannot be created without a name.

a primary key cannot contain NULL values.

**Justification:**
1. Primary Keys Uniquely Identify Records
  * Each row in a table must have a unique identifier.
  * If a primary key contained NULL, it would mean some rows do not have an identifier, violating the concept of uniqueness.
2. Primary Key = UNIQUE + NOT NULL
  * A primary key automatically enforces both:
    * Uniqueness.
    * Not Null.
3. Referential Integrity in Foreign Keys
  * If a primary key were NULL, it could create issues in foreign key references, breaking relationships between tables.

* Example: Primary Key Cannot Be NULL

In [ ]:
CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY, -- Implicitly NOT NULL
    emp_name TEXT NOT NULL
);

Trying to insert a NULL value in emp_id would result in an error:

In [ ]:
INSERT INTO employees (emp_id, emp_name) VALUES (NULL, 'John Doe');
-- ERROR: PRIMARY KEY constraint failed (NULL value not allowed)

##Q 4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.

**Ans** - **Modifying Constraints on an Existing Table**

In SQL, we can add or remove constraints from an existing table using the ALTER TABLE statement.

**1. Adding a Constraint**

To add a constraint, use:

In [ ]:
ALTER TABLE table_name ADD CONSTRAINT constraint_name constraint_type (column_name);

**Example: Adding a CHECK Constraint**

Suppose we have an employees table, and we want to ensure that the salary is at least 30,000.

In [ ]:
ALTER TABLE employees
ADD CONSTRAINT check_salary CHECK (salary >= 30000);

**2. Removing a Constraint**
To remove a constraint, use:

In [ ]:
ALTER TABLE table_name DROP CONSTRAINT constraint_name;

**Example: Removing the CHECK Constraint**

If we want to remove the check_salary constraint:

In [ ]:
ALTER TABLE employees
DROP CONSTRAINT check_salary;

**More Examples for Adding & Removing Constraints**

**Adding a NOT NULL Constraint**

NOT NULL constraints cannot be added directly with ALTER TABLE. Instead, you modify the column:

In [ ]:
ALTER TABLE employees
ALTER COLUMN emp_name SET NOT NULL;

**Removing a NOT NULL Constraint**

In [ ]:
ALTER TABLE employees
ALTER COLUMN emp_name DROP NOT NULL;

**Adding a UNIQUE Constraint**

In [ ]:
ALTER TABLE employees
ADD CONSTRAINT unique_email UNIQUE (email);

**Removing a UNIQUE Constraint**

In [ ]:
ALTER TABLE employees
DROP CONSTRAINT unique_email;

**Conclusion**
* Adding constraints ensures data integrity without recreating the table.
* ALTER TABLE ADD CONSTRAINT is used to add constraints.
* ALTER TABLE DROP CONSTRAINT is used to remove constraints.
* NOT NULL is modified differently using ALTER COLUMN.

##Q 5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints. Provide an example of an error message that might occur when violating a constraint.

**Ans** - **Consequences of Violating Constraints in SQL**

When we attempt to INSERT, UPDATE, or DELETE data in a way that violates constraints, the database will reject the operation and return an error. This ensures that data integrity is maintained.

**1. Consequences of Violating Constraints**

a) NOT NULL Constraint Violation
* Issue: Trying to insert a NULL value into a column with NOT NULL.
* Consequence: The database rejects the operation.
  * Example:

In [ ]:
INSERT INTO employees (emp_id, emp_name, age) VALUES (1, NULL, 25);

Error Message:

In [ ]:
ERROR: Column 'emp_name' cannot be NULL

b) UNIQUE Constraint Violation
* Issue: Inserting a duplicate value into a UNIQUE column.
* Consequence: The database prevents duplication.
  * Example:

In [ ]:
INSERT INTO employees (emp_id, email) VALUES (2, 'john@example.com');
INSERT INTO employees (emp_id, email) VALUES (3, 'john@example.com');  -- Duplicate email

Error Message:

In [ ]:
ERROR: Duplicate entry 'john@example.com' for key 'email'

c) CHECK Constraint Violation
* Issue: Inserting a value that does not meet the CHECK condition.
* Consequence: The database rejects invalid values.
  * Example:

In [ ]:
INSERT INTO employees (emp_id, age) VALUES (4, 16); -- Age should be at least 18

Error Message:

In [ ]:
ERROR: CHECK constraint failed: age must be 18 or older

d) PRIMARY KEY Constraint Violation
* Issue: Trying to insert a duplicate value or NULL into a PRIMARY KEY column.
* Consequence: The database ensures each record is uniquely identifiable.
  * Example:

In [ ]:
INSERT INTO employees (emp_id, emp_name) VALUES (1, 'Alice');
INSERT INTO employees (emp_id, emp_name) VALUES (1, 'Bob');  -- Duplicate ID

Error Message:

In [ ]:
ERROR: Duplicate entry '1' for key 'PRIMARY'

e) FOREIGN KEY Constraint Violation
* Issue: Inserting or updating a record that does not have a matching entry in the referenced table.
* Consequence: The database enforces referential integrity.
  * Example:

In [ ]:
INSERT INTO employees (emp_id, department_id) VALUES (5, 999); -- Department ID 999 does not exist

Error Message:

In [ ]:
ERROR: Foreign key constraint fails: department_id does not exist

**2. Consequences When Violating Constraints During** 'UPDATE' or 'DELETE'
* UPDATE violations: Updating a column to an invalid value (e.g., setting NULL in a NOT NULL column).
* DELETE violations: Deleting a row referenced by a FOREIGN KEY.
  * Example: Trying to Delete a Referenced Record

In [ ]:
DELETE FROM departments WHERE department_id = 1;

Error Message:

In [ ]:
ERROR: Cannot delete or update a parent row: a foreign key constraint fails

##Q 6. You created a products table without constraints as follows: CREATE TABLE products ( product_id INT, product_name VARCHAR(50), price DECIMAL(10, 2)); Now, you realise that The product_id should be a primary key The price should have a default value of 50.00

**Ans** - **Modifying the products Table to Add Constraints**

Since the products table was created without constraints, we need to use the ALTER TABLE command to add a primary key and set a default value for the price column.

**1. Adding PRIMARY KEY Constraint to product_id**

A primary key ensures that:
* Each product_id is unique.
* It cannot be NULL.

In [ ]:
ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

**2. Setting Default Value for price**

A default value ensures that if no price is provided, it automatically defaults to 50.00.

In [ ]:
ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

**Final Table Structure After Modifications**

The products table will now have:
* A primary key on product_id.
* A default value of 50.00 for price.

In [ ]:
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50),
    price DECIMAL(10,2) DEFAULT 50.00
);

**Testing the Changes**
* Inserting a Product Without Specifying price

In [ ]:
INSERT INTO products (product_id, product_name)
VALUES (1, 'Laptop');

* Outcome: The price will automatically be 50.00.

**Inserting a Duplicate** 'product_id'

In [ ]:
INSERT INTO products (product_id, product_name, price)
VALUES (1, 'Phone', 799.99);

Error Message:

In [ ]:
ERROR: Duplicate entry '1' for key 'PRIMARY'

##Q 7. You have two tables:
* Students:

|student_id|student_name|class_id|
|-|||
|1|Alice|101|
|2|Bob|102|
|3|Charlie|101|

* Classes

|class_id|class_name|
|-||
|101|Math|
|102|Science|
|103|History|

Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

**Ans** - To fetch the student_name and class_name for each student using an INNER JOIN, we need to join the Students and Classes tables on the class_id column.

**SQL Query**

In [ ]:
SELECT
    Students.student_name,
    Classes.class_name
FROM Students
INNER JOIN Classes ON Students.class_id = Classes.class_id;

**Explanation:**
1. The INNER JOIN combines rows from both tables where Students.class_id matches Classes.class_id.
2. It selects:
* student_name from the Students table.
* class_name from the Classes table.

**Expected Output:**

|student_name	|class_name|
|-||
|Alice	|Math|
|Bob	|Science|
|Charlie	|Math|

##Q 8. Cosider the following three tables:
* Orders:

|order_id|order_date|customer_id|
|-|||
|1|2024-01-01|101|
|2|2024-01-03|102|

* customers:

|customer_id|customer_name|
|-||
|101|Alice|
|102|Bob|

* Products:

|product_id|product_name|order_id|
|-|||
|1|Laptop|1|
|2|Phone|Null|

Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are listed even if they are not associated with an order Hint: (use INNER JOIN and LEFT JOIN)

**Ans** -  To retrieve all order_id, customer_name, and product_name, ensuring that all products are listed even if they are not associated with an order, we need to use INNER JOIN and LEFT JOIN.

**SQL Query**

In [ ]:
SELECT
    Orders.order_id,
    Customers.customer_name,
    Products.product_name
FROM Products
LEFT JOIN Orders ON Products.order_id = Orders.order_id
LEFT JOIN Customers ON Orders.customer_id = Customers.customer_id;

**Explanation:**
1. LEFT JOIN Products with Orders
* Ensures that all products are included, even if they are not linked to an order (i.e., order_id is NULL in Products).

2. LEFT JOIN Orders with Customers
* Ensures that we retrieve the customer_name associated with each order_id.
* If an order is missing, customer_name will be NULL.

**Expected Output:**

|order_id	|customer_name	|product_name|
|-|||
|1	|Alice	|Laptop|
|NULL	|NULL	|Phone|

* The Laptop is associated with order 1 placed by Alice.
* The Phone is listed even though it is not associated with any order (order_id = NULL).

##Q 9. Given the following tables:
* Sales

|sale_id|product_id|amount|
|-|||
|1|101|500|
|2|102|300|
|3|101|700|

* Products:

|product_id|product_name|
|-||
|101|Laptop|
|102|Phone|

Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

**Ans** - To find the total sales amount for each product using an INNER JOIN and the SUM() function, we can use the following SQL query:

**SQL Query**

In [ ]:
SELECT
    Products.product_name,
    SUM(Sales.amount) AS total_sales
FROM Sales
INNER JOIN Products ON Sales.product_id = Products.product_id
GROUP BY Products.product_name;

**Explanation:**
1. INNER JOIN Sales with Products
* This ensures that we match each sale to its corresponding product using product_id.

2. SUM(Sales.amount)
* This calculates the total sales amount for each product.

3. GROUP BY Products.product_name
* This groups the results by product_name so that we get total sales per product.

**Expected Output:**

|product_name	|total_sales|
|-||
|Laptop	|1200|
|Phone	|300|

* Laptop has total sales of 500 + 700 = 1200.
* Phone has total sales of 300.

##Q 10. You are given three tables:
* Orders:

|order_id|order_date|customer_id|
|-|||
|1|2024-01-02|1|
|2|2024-01-05|2|

* Customers:

|customer_id|customer_name|
|-||
|1|Alice|
|2|Bob|

* Order_Details

|order_id|product_id|quantity|
|-|||
|1|101|2|
|1|102|1|
|2|101|3|

Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.

**Ans** - To display the order_id, customer_name, and quantity of products ordered by each customer using an INNER JOIN across all three tables, use the following SQL query:

**SQL Query**

In [ ]:
SELECT
    Orders.order_id,
    Customers.customer_name,
    Order_Details.quantity
FROM Orders
INNER JOIN Customers ON Orders.customer_id = Customers.customer_id
INNER JOIN Order_Details ON Orders.order_id = Order_Details.order_id;

**Explanation**
1. INNER JOIN Orders with Customers
* This links each order to the respective customer using customer_id.
2. INNER JOIN Orders with Order_Details
* This links each order to its corresponding product details using order_id.
3. Selecting Required Columns
* Orders.order_id: Displays the order number.
* Customers.customer_name: Fetches the customer's name.
* Order_Details.quantity: Displays the number of products ordered.

**Expected Output:**

|order_id	|customer_name	|quantity|
|-|||
|1	|Alice	|2|
|1	|Alice|	2|
|2|	Bob|	3|

#SQL Commands

##Q 1. Identify the primary keys and foreign keys in maven movies db. Discuss the differences.

**Ans** - Primary Keys and Foreign Keys in the Maven Movies Database

**Primary Keys**

Primary keys uniquely identify each record in a table. The following tables and their primary keys were found:
* actor: actor_id
* actor_award: actor_award_id
* address: address_id
* advisor: advisor_id
* category: category_id
* city: city_id
* country: country_id
* customer: customer_id
* film: film_id
* film_actor: (actor_id, film_id) (Composite PK)
* film_category: (film_id, category_id) (Composite PK)
* film_text: film_id
* inventory: inventory_id
* investor: investor_id
* language: language_id
* payment: payment_id
* rental: rental_id
* staff: staff_id
* store: store_id


**Foreign Keys**

Foreign keys create relationships between tables by referencing primary keys in other tables:

* address.city_id → city.city_id
* city.country_id → country.country_id
* customer.address_id → address.address_id
* customer.store_id → store.store_id
* film.language_id → language.language_id
* film.original_language_id → language.language_id
* film_actor.actor_id → actor.actor_id
* film_actor.film_id → film.film_id
* film_category.film_id → film.film_id
* film_category.category_id → category.category_id
* inventory.store_id → store.store_id
* inventory.film_id → film.film_id
* payment.rental_id → rental.rental_id
* payment.customer_id → customer.customer_id
* payment.staff_id → staff.staff_id
* rental.staff_id → staff.staff_id
* rental.inventory_id → inventory.inventory_id
* rental.customer_id → customer.customer_id
* staff.store_id → store.store_id
* staff.address_id → address.address_id
* store.manager_staff_id → staff.staff_id
* store.address_id → address.address_id

**Differences Between Primary Keys and Foreign Keys**

|Feature	|Primary Key	|Foreign Key|
|-|||
|Purpose	|Uniquely identifies a record in a table	|Establishes relationships between tables|
|Uniqueness	|Always unique for each record	|Can have duplicate values|
|Null Values	|Cannot be NULL	|Can be NULL (if relationships are optional)|
|Usage	|Used for identifying records in a table |Used for linking related records in different tables|
|Constraint	|Enforces uniqueness and ensures every row has a valid identifier	|Ensures referential integrity by pointing to a valid primary key in another table|

##Q 2. List all details of actors

**Ans** - To list all details of actors from the Maven Movies database, you can use the following SQL query:

In [ ]:
use mavenmovies;
select * from actor;

This will return all columns from the actor table, including:
* actor_id
* first_name
* last_name
* last_update

##Q 3. List all customer information from DB

In [ ]:
use mavenmovies;
select * from customer;

This will return all columns from the customer table, including:
* customer_id
* store_id
* first_name
* last_name
* email
* address_id
* active
* create_date
* last_update

##Q 4. List different countries.

In [ ]:
use avenmovies;
select country from country;

it will show list of all 109 country like Afganistan, Algeria ....etc.

##Q 5. Display all active customers
**Ans** - To display all active customers we use following command it will show

In [ ]:
use mavenmovies;
select * from customer where active = 1;

##Q 6. List of all rental IDs for customer with ID 1.

In [ ]:
use mavenmovies;
select * from rental where customer_id = 1;

##Q 7. Display all the films whose rental duration is greater than 5 .

In [ ]:
use mavenmovies;
select * from film where rental_duration > 5;

##Q 8. List the total number of films whose replacement cost is greater than $15 and less than 20.

In [ ]:
use mavenmovies;
select * from film where replacement_cost between 15 and 20;

there are total 214 films.

##Q 9. Display the count of unique first names of actors.

In [ ]:
use mavenmovies;
select count(distinct first_name) from actor;

there are total 128 distinct first name

##Q 10. Display the first 10 records from the customer table
**Ans** -

In [ ]:
use mavenmovies;
select * from customer limit 10;

##Q 11. Display the first 3 records from the customer table whose first name starts with ‘b’.

In [ ]:
use mavenmovies;
select * from customer where first_name like 'b%' limit 3;

##Q 12. Display the names of the first 5 movies which are rated as ‘G’.

In [ ]:
use mavenmovies;
select * from film where rating = 'G' limit 5;

##Q 13. Find all customers whose first name starts with "a".

In [ ]:
use mavenmovies;
select * from customer where first_name like 'a%';

##Q 14. Find all customers whose first name ends with "a".

In [ ]:
use mavenmovies;
select * from customer where first_name like '%a';

##Q 15. Display the list of first 4 cities which start and end with ‘a’ .

In [ ]:
use mavenmovies;
select * from city where city like 'a%a' limit 4;

##Q 16. Find all customers whose first name have "NI" in any position.

In [ ]:
use mavenmovies;
select * from customer where first_name like '%NI%';

##Q 17. Find all customers whose first name have "r" in the second position .

In [ ]:
use mavenmovies;
select * from customer where first_name like '_r%';

##Q 18. Find all customers whose first name starts with "a" and are at least 5 characters in length.

In [ ]:
use mavenmovies;
select * from customer where first_name like 'a%' and length(first_name) >= 5;

##Q 19. Find all customers whose first name starts with "a" and ends with "o".

In [ ]:
use mavenmovies;
select * from customer where first_name like 'a%o';

##Q 20. Get the films with pg and pg-13 rating using IN operator.

In [ ]:
use mavenmovies;
select * from film where rating in('PG','PG-13');

##Q 21. Get the films with length between 50 to 100 using between operator.

In [ ]:
use mavenmovies;
select * from film where length between 50 and 100;

##Q 22. Get the top 50 actors using limit operator.

In [ ]:
use mavenmovies;
select * from actor limit 50;

##Q 23. Get the distinct film ids from inventory table.

In [ ]:
use mavenmovies;
select distinct film_id from inventory;

#Functions
##Basic Aggregate Functions

##Q 1. Retrieve the total number of rentals made in the Sakila database. Hint: Use the COUNT() function.

In [ ]:
use sakila;
select count(*) from rental;

##Q 2. Find the average rental duration (in days) of movies rented from the Sakila database. Hint: Utilize the AVG() function. String Functions:

In [ ]:
use sakila;
select avg(datediff(return_date,rental_date)) from rental;

##Q 3. Display the first name and last name of customers in uppercase. Hint: Use the UPPER () function.

In [ ]:
use sakila;
select upper(first_name),upper(last_name) from customer;

##Q 4. Extract the month from the rental date and display it alongside the rental ID. Hint: Employ the MONTH() function. GROUP BY:

In [ ]:
use sakila;
select rental_id,month(rental_date) from rental;

##Q 5. Retrieve the count of rentals for each customer (display customer ID and the count of rentals). Hint: Use COUNT () in conjunction with GROUP BY.

In [ ]:
use sakila;
select customer_id,count(*) from rental group by customer_id;

##Q 6. Find the total revenue generated by each store. Hint: Combine SUM() and GROUP BY.

In [ ]:
use sakila;
select store_id,sum(amount) from payment group by scorer_id;

##Q 7. Determine the total number of rentals for each category of movies. Hint: JOIN film_category, film, and rental tables, then use cOUNT () and GROUP BY.

In [ ]:
use sakila;
select category_id,count(*) from film_category group by category_id;

##Q 8. Find the average rental rate of movies in each language. Hint: JOIN film and language tables, then use AVG () and GROUP BY.Joins

In [ ]:
use sakila;
select language_id,avg(rental_rate) from film group by language_id;

#Joins
##Q 9.  Display the title of the movie, customers first name, and last name who rented it. Hint: Use JOIN between the film, inventory, rental, and customer tables.

In [ ]:
use sakila;
select film.title,customer.first_name,customer.last_name from film_category
inner join film on film_category.film_id = film.film_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
inner join customer on rental.customer_id = customer.customer_id;

##Q 10. Retrieve the names of all actors who have appeared in the film "Gone with the Wind." Hint: Use JOIN between the film actor, film, and actor tables.

In [ ]:
use sakila;
select actor.first_name,actor.last_name from actor
inner join film on film_category.film_id = film.film_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
inner join customer on rental.customer_id = customer.customer_id;

##Q 11. Retrieve the customer names along with the total amount they've spent on rentals. Hint: JOIN customer, payment, and rental tables, then use SUM() and GROUP BY.

In [ ]:
use sakila;
select customer.first_name,customer.last_name,sum(payment.amount) from customer
inner join payment on customer.customer_id = payment.customer_id
group by customer.customer_id;

##Q 12. List the titles of movies rented by each customer in a particular city (e.g., 'London'). Hint: JOIN customer, address, city, rental, inventory, and film tables, then use GROUP BY.

In [ ]:
use sakila;
select customer.first_name,customer.last_name,film.title from customer
inner join address on customer.address_id = address.address_id
inner join city on address.city_id = city.city_id
inner join rental on customer.customer_id = rental.customer_id
inner join inventory on rental.inventory_id = inventory.inventory_id
inner join film on inventory.film_id = film.film_id
where city.city = 'London'
group by customer.customer_id,film.title;

#Advanced Joins and GROUP BY:
##Q 13. Display the top 5 rented movies along with the number of times they've been rented. Hint: JOIN film, inventory, and rental tables, then use COUNT () and GROUP BY, and limit the results.

In [ ]:
use sakila;
select film.title,count(rental.rental_id) from film
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
group by film.title
order by count(rental.rental_id) desc
limit 5;

##Q 14. Determine the customers who have rented movies from both stores (store ID 1 and store ID 2). Hint: Use JOINS with rental, inventory, and customer tables and consider COUNT() and GROUP BY.

In [ ]:
use sakila;
select customer.first_name,customer.last_name from customer
inner join rental on customer.customer_id = rental.customer_id
inner join inventory on rental.inventory_id = inventory.inventory_id
inner join store on inventory.store_id = store.store_id
where store.store_id in (1,2)
group by customer.customer_id
having count(distinct store.store_id) = 2;

#Windows Function:
##Q 1. Rank the customers based on the total amount they've spent on rentals.

In [ ]:
use sakila;
select customer.first_name,customer.last_name,sum(payment.amount),
rank() over (order by sum(payment.amount) dsec) from customer
inner join payment on customer.customer_id = payment.customer_id
group by customer.customer_id;

##Q 2. Calculate the cumulative revenue generated by each film over time.

In [ ]:
use sakila;
select film.title,payment.amount,
sum(payment.amount) over (order by payment.payment_date) from film
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
inner join payment on rental.rental_id = payment.rental_id;

##Q 3. Determine the average rental duration for each film, considering films with similar lengths.

In [ ]:
use sakila;
select film.title,film.length,avg(datediff(rental.return_date,rental.rental_date)) over (partition by film.length) from film
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.invenory_id = rental.inventory_id;

##Q 4. Identify the top 3 films in each category based on their rental counts

In [ ]:
use sakila;
select film.title,category.name,cout(rental.rental_id) over (partition by category.name) from film
inner join film_category on film.film_id = film_category.film_id
inner join category on film_category.category_id = category.category_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
order by count(rental.rental_id) desc
limit 3;

##Q 5. Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

In [ ]:
use sakila;
select customer.first_name,customer.last_name,count(rental.rental_id) over (partition by customer.customer_id) - avg(count(rental.rental_id)) over () as rental_difference from customer
inner join rental on customer.customer_id = rental.customer_id
group by customer.customer_id;

##Q 6. Find the monthly revenue trend for the entire rental store over time.

In [ ]:
use sakila;
select date_format(payment.payment_date,'%Y-%m') as month,sum(payment.amount) from payment
group by month;

##Q 7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [ ]:
use sakila;
select customer.first_name,customer.last_name,sum(payment.amount) over (partition by customer.customer_id) from customer
inner join payment on customer.customer_id = payment.customer_id
order by sum(payment.amount) desc
limit (select count(*) * 0.2 from customer);

##Q 8. Calculate the running total of rentals per category, ordered by rental count.

In [ ]:
use sakila;
select category.name,count(rental.rental_id) over (partition by category.name order by count(rental.rental_id)) from category
inner join film_category on category.category_id = film_category.category_id
inner join film on film_category.film_id = film.film_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id;

##Q 9. Find the films that have been rented less than the average rental count for their respective categories.

In [ ]:
use sakila;
select film.title,count(rental.rental_id) over (partition by category.name) from film
inner join film_category on film.film_id = film_category.film_id
inner join category on film_category.category_id = category.category_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id
where count(rental.rental_id) < select avg(count(rental.rental_id)) over (partition by category.name) from film
inner join film_category on film.film_id = film_category.film_id
inner join category on film_category.category_id = category.category_id
inner join inventory on film.film_id = inventory.film_id
inner join rental on inventory.inventory_id = rental.inventory_id;

##Q 10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [ ]:
use sakila;
select date_format(payment.payment_date,'%Y-%m') as month,sum(payment.amount) from payment
group by month
order by sum(payment.amount) desc
limit 5;

#Normalisation & CTE
##Q 1. First Normal Form (1NF) Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it to achieve 1NF.

one candidate table that violates First Normal Form (1NF) is:
* actor_award table

In [ ]:
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  awards VARCHAR(45) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY  (actor_award_id),
  KEY idx_actor_last_name (last_name)
);

1NF requires:
* indivisible values in each cell.
* No repeating groups or arrays.

The problem lies in the awards column — if this column stores multiple awards as a comma-separated list (e.g., "Best Actor, Lifetime Achievement"), it violates atomicity, breaking 1NF.

**Normalize it to 1NF**

we should break this into two tables:
1. actor_award

In [ ]:
CREATE TABLE actor_award (
  actor_award_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  actor_id SMALLINT NOT NULL,
  first_name VARCHAR(45) NOT NULL,
  last_name VARCHAR(45) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_award_id)
);

2. New Table: actor_award_list

In [ ]:
CREATE TABLE actor_award_list (
  id INT AUTO_INCREMENT PRIMARY KEY,
  actor_award_id SMALLINT UNSIGNED NOT NULL,
  award_name VARCHAR(100) NOT NULL,
  FOREIGN KEY (actor_award_id) REFERENCES actor_award(actor_award_id)
);

**Benefits After Normalization**
* Every value is atomic.
* Easier to query, filter, and count awards.
* Avoids data duplication and improves data integrity

##Q 2. Second Normal Form (2NF):               
a. Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.

Let's choose the film_actor table from the Sakila database to analyze for Second Normal Form (2NF).

**Step 1: Understand the Table**
Here is the likely structure of the film_actor table

In [ ]:
CREATE TABLE film_actor (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_id, film_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
  FOREIGN KEY (film_id) REFERENCES film(film_id)
);

**Step 2: Check for 2NF**

Second Normal Form (2NF) rules:
* Must be in 1NF.
* No partial dependencies of non-prime attributes on part of a composite primary key.

Composite Primary Key:
* (actor_id, film_id) is the composite primary key.

Non-key Attribute:
* last_update

'last_update' depends on the full composite key — it represents the timestamp of the actor-film relationship.
So, this table is already in 2NF.

**if it Violated 2NF**

a modified version of film_actor that violates 2NF:

In [ ]:
CREATE TABLE film_actor (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  actor_name VARCHAR(100),
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_id, film_id)
);

Here, actor_name depends only on actor_id, not the full composite key → partial dependency = violates 2NF.

**How to Normalize to 2NF**

Split into two tables:
1. film_actor

In [ ]:
CREATE TABLE film_actor (
  actor_id SMALLINT UNSIGNED NOT NULL,
  film_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (actor_id, film_id),
  FOREIGN KEY (actor_id) REFERENCES actor(actor_id),
  FOREIGN KEY (film_id) REFERENCES film(film_id)
);

2. actor

In [ ]:
CREATE TABLE actor (
  actor_id SMALLINT UNSIGNED PRIMARY KEY,
  actor_name VARCHAR(100)
);

* Each non-key attribute now depends only on the whole primary key.
* The structure is now in 2NF.

##Q 3. Third Normal Form (3NF):
a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.

A good candidate for analyzing Third Normal Form (3NF) violations in the Sakila database is the address table.

**Step 1: Structure of the address Table**

In [ ]:
CREATE TABLE address (
  address_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  address VARCHAR(50) NOT NULL,
  address2 VARCHAR(50) DEFAULT NULL,
  district VARCHAR(20) NOT NULL,
  city_id SMALLINT UNSIGNED NOT NULL,
  postal_code VARCHAR(10) DEFAULT NULL,
  phone VARCHAR(20) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (address_id),
  FOREIGN KEY (city_id) REFERENCES city(city_id)
);

**Step 2: This Table Violate 3NF**

3NF Rule Recap:
* Must be in 2NF.
* No transitive dependencies: Non-prime attributes should not depend on other non-prime attributes.

* In this table:
  * city_id → city_name, country_id (via the city table)
  * country_id → country_name (via the country table)

That means:

* address table indirectly contains redundant transitive data if it includes data like city_name or country_name.

If we embed city_name and country_name directly in the address table, then we have a transitive dependency:

In [ ]:
address → city_id → country_id → country_name

This would violate 3NF.

**Step 3: How to Normalize to 3NF**

To achieve 3NF:
1. Keep city_id in address (as a foreign key).
2. Move city_name and country_id to a separate city table.
3. Move country_name to a separate country table.

These already exist in the Sakila schema:

In [ ]:
CREATE TABLE city (
  city_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  city VARCHAR(50) NOT NULL,
  country_id SMALLINT UNSIGNED NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (city_id),
  FOREIGN KEY (country_id) REFERENCES country(country_id)
);

CREATE TABLE country (
  country_id SMALLINT UNSIGNED NOT NULL AUTO_INCREMENT,
  country VARCHAR(50) NOT NULL,
  last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (country_id)
);

**Final 3NF Structure**
* address → refers to city_id
* city → refers to country_id
* country → contains country name

Each non-key attribute in any table depends only on the primary key of its table, and not on another non-key → this is 3NF-compliant.

**Summary**
* Table that can violate 3NF: address (if city or country info is added directly)
* Transitive Dependency: address → city_id → country_id → country_name
* Normalization Fix: Keep city and country details in separate tables and use foreign keys.

##Q 4. Normalization Process:               

a. Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to at least 2NF.

Let’s take the customer table from the Sakila database and walk through the normalization process — from an unnormalized form to at least Second Normal Form.

**Initial Unnormalized Form**

Let's assume the customer table initially looks like this

In [ ]:
CREATE TABLE customer_raw (
  customer_id INT,
  full_name VARCHAR(100),
  phone_numbers VARCHAR(100), -- e.g., "1234567890,0987654321"
  address VARCHAR(100),
  city VARCHAR(50),
  country VARCHAR(50),
  rental_history TEXT, -- e.g., "Film1:2022-01-01, Film2:2022-01-05"
  PRIMARY KEY (customer_id)
);

**Problems in UNF**
* phone_numbers and rental_history are multi-valued (comma-separated).
* full_name is not atomic — it contains first and last names together.
* city and country are stored redundantly.

**Step 1: Convert to First Normal Form**

Fix:
* Split multi-valued fields into separate rows/tables.
* Ensure atomic attributes (split full name).

**Normalized Tables (1NF)**
* customer

In [ ]:
CREATE TABLE customer (
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  address VARCHAR(100)
);

* customer_phone

In [ ]:
CREATE TABLE customer_phone (
  customer_id INT,
  phone_number VARCHAR(20),
  PRIMARY KEY (customer_id, phone_number),
  FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);

* customer_rental

In [ ]:
CREATE TABLE customer_rental (
  customer_id INT,
  film_title VARCHAR(100),
  rental_date DATE,
  PRIMARY KEY (customer_id, film_title),
  FOREIGN KEY (customer_id) REFERENCES customer(customer_id)
);

**Step 2: Convert to Second Normal Form**

2NF requires:
* Already in 1NF
* No partial dependency on a composite primary key

Let's imagine this table (1NF version of customer_rental):

In [ ]:
CREATE TABLE customer_rental (
  customer_id INT,
  film_title VARCHAR(100),
  rental_date DATE,
  film_category VARCHAR(50), --  Issue
  PRIMARY KEY (customer_id, film_title)
);

**Problem**
* film_category depends only on film_title, not on full composite key → partial dependency

**Fix (Normalize to 2NF)**
* Step 1: Create film table:

In [ ]:
CREATE TABLE film (
  film_title VARCHAR(100) PRIMARY KEY,
  film_category VARCHAR(50)
);

* Step 2: Update customer_rental:

In [ ]:
CREATE TABLE customer_rental (
  customer_id INT,
  film_title VARCHAR(100),
  rental_date DATE,
  PRIMARY KEY (customer_id, film_title),
  FOREIGN KEY (customer_id) REFERENCES customer(customer_id),
  FOREIGN KEY (film_title) REFERENCES film(film_title)
);

Now
* customer_rental has no partial dependency.
* Each non-key attribute depends on the whole composite key.

**Summary of Normalization**

|Stage	|Description|
|-||
|UNF	|Multi-valued & non-atomic fields (phone_numbers, rental_history, full_name)|
|1NF	|All fields atomic. Separate tables for phones and rentals|
|2NF	|Removed partial dependencies (e.g., film_category) by splitting film into a separate table|

##Q 5. CTE Basics:                
a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables.

SQL query using a Common Table Expression (CTE) to retrieve the distinct list of actor names along with the number of films they have acted in, using the actor and film_actor tables from the Sakila database:

In [ ]:
WITH actor_film_count AS (
    SELECT
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
        COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT * FROM actor_film_count
ORDER BY film_count DESC;

**What This Query Does**
* CTE actor_film_count:
  * Joins actor and film_actor tables.
  * Groups by actor_id to count the number of films each actor has appeared in.
  * Concatenates first_name and last_name for display.
* Final SELECT:
  * Retrieves the actor names and their film counts.
  * Orders the result by the number of films in descending order.

##Q 6. CTE with Joins:                
a. Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.

SQL query using a Common Table Expression (CTE) that joins the film and language tables to display the film title, language name, and rental rate:

In [ ]:
WITH film_language_info AS (
    SELECT
        f.film_id,
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT film_title, language_name, rental_rate
FROM film_language_info
ORDER BY film_title;

**What This Query Does**
* CTE film_language_info:
  * Joins film and language on language_id.
  * Selects the film_id, title, language name, and rental rate.

* Final SELECT:
  * Displays the film_title, language_name, and rental_rate from the CTE.
  * Orders results alphabetically by film title.

##Q 7. CTE for Aggregation:               
a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tables.

In [ ]:
WITH customer_revenue AS (
    SELECT
        c.customer_id,
        CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
        SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT *
FROM customer_revenue
ORDER BY total_revenue DESC;

**Explanation**
* CTE customer_revenue:
  * Joins customer and payment on customer_id.
  * Calculates the total sum of amount paid by each customer.
  * Concatenates first_name and last_name to create a full name.
* Final SELECT:
  * Retrieves all records from the CTE.
  * Orders by total_revenue in descending order to show the highest-paying customers first.

##Q 8. CTE with Window Functions:
a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.

In [ ]:
WITH film_rental_ranks AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS rental_rank
    FROM film
)
SELECT *
FROM film_rental_ranks
ORDER BY rental_rank, title;

**Explanation**
* CTE film_rental_ranks:
  * Selects each film's film_id, title, and rental_duration.
  * Uses RANK() as a window function to assign a rank to each film based on rental_duration (highest duration ranked 1).
* Final SELECT:
  * Retrieves the data including the calculated rank.
  * Orders the results by rental_rank, then alphabetically by title.

##Q 9. CTE and Filtering:               
a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

In [ ]:
WITH frequent_customers AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS rental_count
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(rental_id) > 2
)
SELECT
    c.customer_id,
    CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
    c.email,
    c.address_id,
    fc.rental_count
FROM frequent_customers fc
JOIN customer c ON fc.customer_id = c.customer_id
ORDER BY fc.rental_count DESC;

**Explanation**
* CTE frequent_customers:
  * Groups the rental table by customer_id.
  * Filters for customers with more than 2 rentals.
* Main Query:
  * Joins the CTE with the customer table to get full name, email, and address ID.
  * Orders by number of rentals in descending order to show the most active customers first.

##Q 10. CTE for Date Calculations:
a. Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table

In [ ]:
WITH monthly_rentals AS (
    SELECT
        DATE_FORMAT(rental_date, '%Y-%m') AS rental_month,
        COUNT(*) AS total_rentals
    FROM rental
    GROUP BY DATE_FORMAT(rental_date, '%Y-%m')
)
SELECT *
FROM monthly_rentals
ORDER BY rental_month;

**Explanation**
* CTE monthly_rentals:
  * Uses DATE_FORMAT(rental_date, '%Y-%m') to extract the year and month.
  * Groups by month and counts the number of rentals.
* Final SELECT:
  * Returns each month with its total rental count.
  * Ordered chronologically by month.

##Q 11. CTE and Self-Join:
a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

In [ ]:
WITH actor_pairs AS (
    SELECT
        fa1.film_id,
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id
    FROM film_actor fa1
    JOIN film_actor fa2
        ON fa1.film_id = fa2.film_id
       AND fa1.actor_id < fa2.actor_id -- avoid self-pair and duplicate pairs
)
SELECT
    ap.film_id,
    a1.first_name || ' ' || a1.last_name AS actor1_name,
    a2.first_name || ' ' || a2.last_name AS actor2_name
FROM actor_pairs ap
JOIN actor a1 ON ap.actor1_id = a1.actor_id
JOIN actor a2 ON ap.actor2_id = a2.actor_id
ORDER BY ap.film_id, actor1_name, actor2_name;

**Explanation**
* CTE actor_pairs:
  * Joins film_actor with itself (fa1 and fa2) on the same film_id.
  * Uses fa1.actor_id < fa2.actor_id to avoid:
    * Repeating the same actor (e.g., A with A).
    * Duplicate pairs (e.g., A-B and B-A).
* Main Query:
  * Joins the CTE with the actor table twice to get actor names.
  * Outputs film_id along with each unique actor pair.

**Example Output:**

|film_id	|actor1_name	|actor2_name|
|-|||
|10	|Tom Hanks	|Meg Ryan|
|10	|Tom Hanks	|Tim Allen|
|10	|Meg Ryan	|Tim Allen|

##Q 12. CTE for Recursive Search:
a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column

In [ ]:
WITH RECURSIVE reporting_hierarchy AS (
    -- Anchor member: start with the given manager
    SELECT
        staff_id,
        first_name,
        last_name,
        reports_to
    FROM staff
    WHERE reports_to = 1  -- change this value to the desired manager_id

    UNION ALL

    -- Recursive member: find employees who report to the employees already found
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM staff s
    INNER JOIN reporting_hierarchy rh ON s.reports_to = rh.staff_id
)

SELECT *
FROM reporting_hierarchy
ORDER BY reports_to, staff_id;

**Explanation**
* Anchor member: Gets all staff who report directly to the given manager (e.g., staff_id = 1).
* Recursive member: Finds staff who report to those in the previous level — climbing down the hierarchy.
* The final SELECT lists all direct and indirect reports in a nice hierarchy.